app/Http/Controllers/User/AddMoneyController.php

select * from `user_wallets` where `user_id` = 2
select * from `currencies` where `id` in (1)
select * from `transactions` where `user_id` = 2 and `type` = 'ADD-MONEY' order by `id` desc, `created_at` desc limit 3
---
    public function index()
    {
        $page_title = 'Add Money';
        $user_wallets = UserWallet::auth()->get();
        $user_currencies = Currency::whereIn('id', $user_wallets->pluck('currency_id')->toArray())->get();
        $payment_gateways = PaymentGateway::addMoney()->active()->with('currencies')->has('currencies')->get();
        $transactions = Transaction::auth()->addMoney()->orderByDesc('id')->latest()->take(3)->get();

select * from `temporary_datas` where `identifier` = 'jx2cZY3lr4o5TeGA' limit 1
---
    public function submit(Request $request, PaymentGatewayCurrency $gateway_currency)
    {

        $validated = Validator::make($request->all(), [
            'amount' => 'required|numeric|gt:0',
            'gateway_currency' => 'required|string|exists:'.$gateway_currency->getTable().',alias',
        ])->validate();

        if (! auth()->user()->add_money_status) {
            return back()->with(['error' => [__('Add money service is currently disabled for your account.')]]);
        }

        $request->merge(['currency' => $validated['gateway_currency']]);

        try {
            $instance = PaymentGatewayHelper::init($request->all())->type(PaymentGatewayConst::TYPEADDMONEY)->setProjectCurrency(PaymentGatewayConst::PROJECT_CURRENCY_SINGLE)->gateway()->get();

            if ($instance instanceof RedirectResponse === false && isset($instance['gateway_type']) && $instance['gateway_type'] == PaymentGatewayConst::MANUAL) {
                $manual_handler = $instance['distribute'];

                return $this->$manual_handler($instance);
            }

            $token = generate_unique_string('temporary_datas', 'identifier', 16);
            TemporaryData::create([
                'type' => PaymentGatewayConst::add_money_slug(),
                'identifier' => $token,
                'data' => ['instance' => $instance, 'request' => $request->all()],
            ]);