app/Http/Controllers/User/FundTransferController.php

    public function index()
    {
        $page_title = 'Select Beneficiary';
        $beneficiaries = Beneficiary::auth()->orderByDesc('id')->paginate(10);
---
select count(*) as aggregate from `beneficiaries` where `user_id` = 2