app/Http/Controllers/User/InvestmentOfferController.php

    public function index(Request $request)
    {
        $page_title = __('Investment Opportunities');
        $query = InvestmentAsset::where('status', true);
        if ($request->filled('type')) {
            $query->where('offering_type', $request->type);
        }
        $assets = $query->orderBy('name')->paginate(12);
---
select * from `investment_assets` where `status` = 1 order by `name` asc limit 12 offset 0
select count(*) as aggregate from `investment_assets` where `status` = 1