app/Http/Controllers/User/LoanController.php

    public function index(Request $request)
    {
        $page_title = __('Loans');
        $query = Loan::with(['product'])
            ->where('user_id', Auth::id())
            ->when($request->get('q'), function ($q) use ($request) {
                $term = $request->get('q');
                $q->where(function ($sub) use ($term) {
                    $sub->where('status', 'like', "%{$term}%")
                        ->orWhereHas('product', function ($p) use ($term) {
                            $p->where('name', 'like', "%{$term}%");
                        });
                });
            })
            ->orderByDesc('created_at');

        $loans = $query->paginate(10);
---
select count(*) as aggregate from `loans` where `user_id` = 2

    public function create()
    {
        $page_title = __('Apply Loan');
        $products = LoanProduct::where('status', true)->orderBy('name')->get();
---
select * from `loan_products` where `status` = 1 order by `name` asc

    public function stats()
    {
        $userId = Auth::id();
        $loansForLate = Loan::where('user_id', $userId)->get();
        $calc = app(LoanCalculator::class);
        foreach ($loansForLate as $ln) {
            $calc->applyLateFees($ln, now());
        }
        $totalPrincipal = Loan::where('user_id', $userId)->sum('principal');
        $totalBalance = Loan::where('user_id', $userId)->sum('balance_principal');
        $activeCount = Loan::where('user_id', $userId)->where('status', 'active')->count();
        $pendingCount = Loan::where('user_id', $userId)->where('status', 'pending')->count();
        $closedCount = Loan::where('user_id', $userId)->where('status', 'closed')->count();

        $upcoming = LoanPayment::whereHas('loan', function ($q) use ($userId) {
            $q->where('user_id', $userId);
        })->where('status', 'due')->orderBy('due_date')->limit(6)->get(['due_date', 'amount_due']);
---
select * from `loans` where `user_id` = 2
select sum(`principal`) as aggregate from `loans` where `user_id` = 2
select sum(`balance_principal`) as aggregate from `loans` where `user_id` = 2
select count(*) as aggregate from `loans` where `user_id` = 2 and `status` = 'active'
select count(*) as aggregate from `loans` where `user_id` = 2 and `status` = 'pending'
select count(*) as aggregate from `loans` where `user_id` = 2 and `status` = 'closed'
select `due_date`, `amount_due` from `loan_payments` where exists (select * from `loans` where `loan_payments`.`loan_id` = `loans`.`id` and `user_id` = 2) and `status` = 'due' order by `due_date` asc limit 6