app/Http/Controllers/User/MoneyOutController.php

select * from `user_wallets` where `user_id` = 2
select * from `transactions` where `user_id` = 2 and `type` = 'MONEY-OUT' order by `id` desc
---
    public function index()
    {
        $page_title = 'Money Out';
        $payment_gateways = PaymentGateway::moneyOut()->manual()->active()->get();
        $user_wallets = UserWallet::auth()->get();
        $transactions = Transaction::auth()->moneyOut()->orderByDesc('id')->get();