app/Http/Controllers/User/PortfolioController.php

    public function index(Request $request)
    {
        $page_title = __('Investment Portfolio');
        $query = Portfolio::withCount('holdings')->where('user_id', Auth::id());
        $portfolios = $query->orderBy('created_at', 'desc')->paginate(10);
---
select count(*) as aggregate from `portfolios` where `user_id` = 2

    public function store(Request $request)
    {
        $request->validate([
            'name' => ['required', 'string', 'max:100'],
        ]);

        Portfolio::create([
            'user_id' => Auth::id(),
            'name' => $request->name,
        ]);
---
insert into `portfolios` (`user_id`, `name`, `updated_at`, `created_at`) values (2, 'CHISOM EMMANUEL', '2026-03-13 04:37:33', '2026-03-13 04:37:33')

    public function show($id)
    {
        $portfolio = Portfolio::with(['holdings.asset', 'transactions.asset'])
            ->where('user_id', Auth::id())
            ->findOrFail($id);
        $page_title = $portfolio->name;
        $assets = InvestmentAsset::where('status', true)->orderBy('name')->get();
---
select * from `portfolios` where `user_id` = 2 and `portfolios`.`id` = '1' limit 1
select * from `investment_assets` where `status` = 1 order by `name` asc

    public function destroy($id)
    {
        $portfolio = Portfolio::where('user_id', Auth::id())->findOrFail($id);
---
select * from `portfolios` where `user_id` = 2 and `portfolios`.`id` = '1' limit 1

    public function addHolding(Request $request, $id)
    {
        $portfolio = Portfolio::where('user_id', Auth::id())->findOrFail($id);
        $request->validate([
            'asset_id' => ['required', 'exists:investment_assets,id'],
            'quantity' => ['required', 'numeric', 'min:0.00000001'],
            'price' => ['required', 'numeric', 'min:0'],
        ]);

        $holding = PortfolioHolding::firstOrCreate(
            ['portfolio_id' => $portfolio->id, 'investment_asset_id' => $request->asset_id],
            ['quantity' => 0, 'avg_cost' => 0]
        );

        $totalCost = ($holding->quantity * $holding->avg_cost) + ($request->quantity * $request->price);
        $newQty = $holding->quantity + $request->quantity;
        $holding->quantity = $newQty;
        $holding->avg_cost = $newQty > 0 ? ($totalCost / $newQty) : 0;
        $holding->save();

        PortfolioTransaction::create([
            'portfolio_id' => $portfolio->id,
            'investment_asset_id' => $request->asset_id,
            'type' => 'buy',
            'quantity' => $request->quantity,
            'price' => $request->price,
            'fee' => $request->input('fee', 0),
            'executed_at' => now(),
        ]);
---
insert into `portfolio_holdings` (`portfolio_id`, `investment_asset_id`, `quantity`, `avg_cost`, `updated_at`, `created_at`) values (1, '4', 0, 0, '2026-03-13 04:38:16', '2026-03-13 04:38:16')
select * from `portfolio_holdings` where (`portfolio_id` = 1 and `investment_asset_id` = '4') limit 1
update `portfolio_holdings` set `quantity` = 3, `avg_cost` = 332.999997, `portfolio_holdings`.`updated_at` = '2026-03-13 04:38:16' where `id` = 1
insert into `portfolio_transactions` (`portfolio_id`, `investment_asset_id`, `type`, `quantity`, `price`, `fee`, `executed_at`, `updated_at`, `created_at`) values (1, '4', 'buy', '3', '332.999997', 0, '2026-03-13 04:38:16', '2026-03-13 04:38:16', '2026-03-13 04:38:16')

    public function removeHolding(Request $request, $id)
    {
        $portfolio = Portfolio::where('user_id', Auth::id())->findOrFail($id);
        $request->validate([
            'holding_id' => ['required', 'exists:portfolio_holdings,id'],
        ]);
        $holding = PortfolioHolding::where('portfolio_id', $portfolio->id)->findOrFail($request->holding_id);
---
select * from `portfolios` where `user_id` = 2 and `portfolios`.`id` = '1' limit 1
select * from `portfolio_holdings` where `portfolio_holdings`.`portfolio_id` = 1 and `portfolio_holdings`.`portfolio_id` is not null