app/Http/Controllers/User/StrowalletVirtualCardController.php

select * from `virtual_card_apis` limit 1
select * from `basic_settings` limit 1
---
    public function __construct()
    {
        $card_api = VirtualCardApi::first();
        $this->api = $card_api;
        $this->card_limit = $card_api->card_limit ?? 0;
        $this->basic_settings = BasicSettings::first();