app/Http/Controllers/User/SupportTicketController.php

select count(*) as aggregate from `user_support_tickets` where `user_id` = 2
---
    public function index()
    {
        $page_title = 'Support Tickets';
        $support_tickets = UserSupportTicket::authTickets()->orderByDesc('id')->paginate(10);