app/Http/Controllers/User/TransactionController.php

select * from `transactions` where `user_id` = 2 order by `id` desc limit 12 offset 0
select count(*) as aggregate from `transactions` where `user_id` = 2
---
    public function index($slug = null)
    {
        $walletId = auth()->user()->wallet?->id;
        if ($slug != null) {
            $transactions = Transaction::where(function ($q) use ($walletId) {
                $q->where('user_id', auth()->id())
                    ->orWhere(function ($q2) use ($walletId) {
                        $q2->where('receiver_id', $walletId)
                            ->where('attribute', '!=', GlobalConst::SEND);
                    });
            })->where('type', $this->slugValue($slug))->orderByDesc('id')->paginate(12);