app/Http/Helpers/helpers.php

function get_admin_notifications()
{
    $admin = auth()->user();
    $notification_clear_at =   $admin->notification_clear_at;
    if ($notification_clear_at  == null) {
        $notifications = AdminNotification::notAuth()->getByType([NotificationConst::SIDE_NAV])->get();
---
select * from `admin_notifications` where `admin_id` != 1 and `type` in ('SIDE_NAV')

function get_user_notifications()
{
    $notifications = UserNotification::auth()->latest('id')->take(4)->get();
---
select * from `user_notifications` where `user_id` = 2 order by `id` desc limit 4

function authWalletBalance(){
    if(auth()->guard('web')->check()){
        $wallet         = UserWallet::auth()->first();
---
select * from `user_wallets` where `user_id` = 2 limit 1