app/Http/Helpers/PaymentGateway.php

    public function gateway()
    {
        $request_data = $this->request_data;

        if (empty($request_data)) {
            throw new Exception('Gateway Information is not available. Please provide payment gateway currency alias');
        }

        $validated = $this->validator($request_data)->validate();
        $gateway_currency = PaymentGatewayCurrency::where('alias', $validated[$this->currency_input_name])->first();
---
select * from `payment_gateway_currencies` where `alias` = 'add-money-coingate-usdt-automatic' limit 1