app/Http/Controllers/Admin/HolidayController.php

    public function index()
    {
        $page_title = __('Holidays');
        $holidays = Holiday::orderBy('holiday_date')->paginate(20);
---
select * from `holidays` order by `holiday_date` asc limit 20 offset 0
select count(*) as aggregate from `holidays`