app/Http/Controllers/Admin/PaymentGatewayCurrencyController.php

    public function paymentGatewayCurrencyRemove(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'data_target' => 'required|numeric',
        ]);

        if ($validator->stopOnFirstFailure()->fails()) {
            return Response::error($validator->errors());
        }

        $validated = $validator->validate();

        // find terget Item
        $gateway_currency = PaymentGatewayCurrency::find($validated['data_target']);
        if (! $gateway_currency) {
            $error = ['error' => ['Payment gateway currency not found!']];

            return Response::error($error, null, 404);
        }

        try {
            if ($gateway_currency->image != null) {
                $image_link = get_files_path('payment-gateways').'/'.$gateway_currency->image;
                delete_file($image_link);
            }
            $gateway_currency->delete();
---
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = '2' limit 1
delete from `payment_gateway_currencies` where `id` = 2