app/Http/Controllers/Admin/PaymentGatewaysController.php

    public function paymentGatewayStatusUpdate(Request $request)
    {

        $validator = Validator::make($request->all(), [
            'status' => 'required|boolean',
            'data_target' => 'required|string',
        ]);
        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];

            return Response::error($error, null, 400);
        }
        $validated = $validator->validate();
        $item_id = $validated['data_target'];

        $payment_gateway = PaymentGateway::find($item_id);
        if (! $payment_gateway) {
            $error = ['error' => ['Payment gateway not found!.']];

            return Response::error($error, null, 404);
        }

        try {
            $payment_gateway->update([
                'status' => ($validated['status'] == true) ? false : true,
            ]);
---
select * from `payment_gateways` where `payment_gateways`.`id` = '4' limit 1
update `payment_gateways` set `status` = 0, `payment_gateways`.`updated_at` = '2026-03-13 06:33:30' where `id` = 4