app/Http/Controllers/Admin/UserCareController.php

    public function index()
    {
        $page_title = 'All Users';
        $users = User::with(['wallet.currency'])->orderBy('id', 'desc')->paginate(12);
---
select * from `users` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `users`

    public function KycUnverified()
    {
        $page_title = 'KYC Unverified Users';
        $users = User::kycUnverified()->with(['wallet.currency'])->orderBy('id', 'desc')->paginate(8);
---
select * from `user_wallets` where `user_wallets`.`user_id` in (2)

    public function userDetails($username)
    {
        $page_title = 'User Details';
        $user = User::with(['wallet', 'wallets'])->where('username', $username)->first();
        if (! $user) {
            return back()->with(['error' => ['Opps! User not exists']]);
        }
        $total_transactions = Transaction::where('user_id', $user->id)->count();
        $success_transactions = Transaction::where('user_id', $user->id)
            ->where('status', PaymentGatewayConst::STATUSSUCCESS)
            ->count();
        $pending_transactions = Transaction::where('user_id', $user->id)
            ->where('status', PaymentGatewayConst::STATUSPENDING)
            ->count();

        $total_tickets = UserSupportTicket::where('user_id', $user->id)->count();
---
select count(*) as aggregate from `transactions` where `user_id` = 2 and `status` = 2
select count(*) as aggregate from `user_support_tickets` where `user_id` = 2 and `status` = 1